[
    {
      "id": 1,
      "title": "Romance Dawn",
      "description": "The Romance Dawn arc marks the beginning of Monkey D. Luffy's incredible journey as a pirate. In this arc, we witness Luffy's encounter with the Gum-Gum Fruit, which grants him incredible stretching abilities, and the tragic loss of his mentor, Shanks's arm. This arc sets the stage for Luffy's quest to become the Pirate King.",
      "episodes": 4,
      "image": "/romance_dawn.jpg",
      "time": 2.5,
      "created_date": "2021-01-15",
      "finished_date": "2021-01-20",
      "rate": 4.8
    },
    {
      "id": 2,
      "title": "Orange Town",
      "description": "The Orange Town arc introduces us to Luffy's pirate crew as they face the devious Buggy the Clown and his gang in the whimsical Orange Town. We see the crew's resourcefulness as they navigate through dangerous traps and schemes, setting the tone for their adventures to come.",
      "episodes": 4,
      "image": "/orange_town.jpg",
      "time": 2.5,
      "created_date": "2021-01-22",
      "finished_date": "2021-01-27",
      "rate": 4.5
    },
    {
      "id": 3,
      "title": "Syrup Village",
      "description": "In the Syrup Village arc, the Straw Hat Pirates lend their strength to Usopp and his friends, defending their peaceful village against the menacing Kuro Pirates. This arc explores themes of friendship and heroism as the crew bonds with Usopp and takes a stand against Captain Kuro's treacherous plans.",
      "episodes": 3,
      "image": "/syrup_village.jpg",
      "time": 1.8,
      "created_date": "2021-02-01",
      "finished_date": "2021-02-04",
      "rate": 4.3
    },
    {
      "id": 4,
      "title": "Baratie",
      "description": "The Baratie arc sees Luffy and his crew discovering the floating restaurant Baratie, where they meet its battle-hardened owner, Zeff. As they enjoy a temporary alliance, they face off against the vicious Don Krieg and his armada. This arc showcases the crew's determination to protect those they care about.",
      "episodes": 21,
      "image": "/baratie.jpg",
      "time": 13.5,
      "created_date": "2021-02-10",
      "finished_date": "2021-03-01",
      "rate": 4.7
    },
    {
      "id": 5,
      "title": "Arlong Park",
      "description": "Arlong Park is where Luffy's crew confronts the tyrannical Arlong and his Fish-Man Pirates, who have enslaved Nami's hometown. Luffy's unwavering resolve to free Nami and liberate her people drives this emotional and action-packed arc, highlighting the crew's commitment to their friends.",
      "episodes": 41,
      "image": "/arlong_park.jpg",
      "time": 26.0,
      "created_date": "2021-03-10",
      "finished_date": "2021-04-05",
      "rate": 4.9
    },
    {
      "id": 6,
      "title": "Loguetown",
      "description": "Loguetown is the last stop before the Grand Line, and it's filled with excitement and danger. The crew encounters the Marine Captain Smoker and the scheming Buggy the Clown. Luffy's dream of becoming Pirate King becomes more palpable as he stands at the entrance to the world's most treacherous sea.",
      "episodes": 3,
      "image": "/logue_town.jpg",
      "time": 1.9,
      "created_date": "2021-04-10",
      "finished_date": "2021-04-13",
      "rate": 4.6
    },
    {
      "id": 7,
      "title": "Reverse Mountain",
      "description": "The Reverse Mountain arc kicks off the Arabasta Saga as the Straw Hat Pirates navigate the treacherous waters of Reverse Mountain, encountering giant whales and other dangers. This journey brings them one step closer to the Grand Line, setting the stage for their adventures in the Arabasta Kingdom.",
      "episodes": 1,
      "image": "/reverse_mountain.jpg",
      "time": 0.5,
      "created_date": "2021-04-15",
      "finished_date": "2021-04-16",
      "rate": 4.2
    },
    {
      "id": 8,
      "title": "Whiskey Peak",
      "description": "In the Whiskey Peak arc, the crew reaches the island of Whiskey Peak, where they are welcomed as heroes by its residents. However, things take a dark turn as they uncover a sinister plot involving the secret organization Baroque Works. This arc showcases the crew's instincts and loyalty.",
      "episodes": 4,
      "image": "/whiskey_peak.jpg",
      "time": 2.5,
      "created_date": "2021-04-20",
      "finished_date": "2021-04-25",
      "rate": 4.4
    },
    {
        "id": 9,
        "title": "Little Garden",
        "description": "The Little Garden arc takes the Straw Hat Pirates to an ancient island inhabited by dinosaurs and giant animals. Here, they face off against the powerful Baroque Works agents, Mr. 3 and Miss Goldenweek. The crew's resourcefulness and determination are put to the test as they continue their pursuit of the elusive Crocodile.",
        "episodes": 4,
        "image": "/little_garden.jpg",
        "time": 2.5,
        "created_date": "2021-05-01",
        "finished_date": "2021-05-05",
        "rate": 4.3
      },
      {
        "id": 10,
        "title": "Drum Island",
        "description": "Drum Island is where the crew encounters the desperate kingdom of Drum and its cruel ruler, Wapol. The crew's mission to find a doctor for the ailing Nami takes them on a perilous adventure through the snowy landscape, culminating in a dramatic battle against Wapol's forces.",
        "episodes": 7,
        "image": "/drum_island.jpg",
        "time": 4.5,
        "created_date": "2021-05-10",
        "finished_date": "2021-05-20",
        "rate": 4.7
      },
      {
        "id": 11,
        "title": "Alabasta",
        "description": "The Alabasta arc is the central storyline of the Arabasta Saga. Luffy and his crew become embroiled in a rebellion against the evil Crocodile, who seeks to take control of the desert kingdom of Arabasta. This epic arc explores themes of justice and sacrifice as the crew fights to free the kingdom from tyranny.",
        "episodes": 67,
        "image": "/alabasta.jpg",
        "time": 42.0,
        "created_date": "2021-06-01",
        "finished_date": "2021-07-15",
        "rate": 4.9
      },
      {
        "id": 12,
        "title": "Jaya",
        "description": "The Jaya arc introduces the crew to the infamous pirate Blackbeard and sets the stage for their journey to the sky island of Skypiea. This arc delves into the mysteries of the Grand Line and the pursuit of dreams, as the crew follows a fabled log pose to an unknown destination.",
        "episodes": 1,
        "image": "/jaya.jpg",
        "time": 0.5,
        "created_date": "2021-07-20",
        "finished_date": "2021-07-21",
        "rate": 4.2
      },
      {
        "id": 13,
        "title": "Skypiea",
        "description": "The Skypiea arc takes the Straw Hat Pirates to the legendary sky island of Skypiea, where they encounter a unique culture and face off against the enigmatic Eneru. This arc explores themes of belief, dreams, and the pursuit of the legendary treasure known as 'One Piece.'",
        "episodes": 52,
        "image": "/skypiea.jpg",
        "time": 33.0,
        "created_date": "2021-08-01",
        "finished_date": "2021-09-10",
        "rate": 4.8
      },
      {
        "id": 14,
        "title": "G-8",
        "description": "In the G-8 arc, the crew accidentally stumbles upon a Marine base in the middle of the ocean. They must outsmart the clever Marine Commander Jonathan and find a way to escape without revealing their true identities.",
        "episodes": 11,
        "image": "/g8.jpg",
        "time": 7.0,
        "created_date": "2021-09-15",
        "finished_date": "2021-10-05",
        "rate": 4.4
      },
      {
        "id": 15,
        "title": "Long Ring Long Land",
        "description": "The Long Ring Long Land arc introduces the crew to the eccentric Foxy Pirates and their Davy Back Fight contest. Luffy and his crew engage in a series of wacky challenges, with the future of their crewmates on the line.",
        "episodes": 19,
        "image": "/long_ring_long_land.jpg",
        "time": 12.0,
        "created_date": "2021-10-10",
        "finished_date": "2021-10-25",
        "rate": 4.6
      },
      {
        "id": 16,
        "title": "Water 7",
        "description": "Water 7 is a pivotal arc where the Straw Hat Pirates arrive at the bustling city on water and face challenges that threaten to tear them apart. Betrayal, intrigue, and an emotionally charged farewell are at the heart of this arc.",
        "episodes": 78,
        "image": "/water_7.jpg",
        "time": 49.5,
        "created_date": "2021-11-01",
        "finished_date": "2022-01-15",
        "rate": 4.9
      },
      {
        "id": 17,
        "title": "Enies Lobby",
        "description": "The Enies Lobby arc is a high-stakes adventure where the crew storms the judicial island Enies Lobby to rescue their captured friend Nico Robin. This arc features epic battles, intense confrontations, and a powerful declaration of camaraderie.",
        "episodes": 41,
        "image": "/enies_lobby.jpg",
        "time": 26.0,
        "created_date": "2022-02-01",
        "finished_date": "2022-03-01",
        "rate": 4.8
      },
      {
        "id": 18,
        "title": "Post-Enies Lobby",
        "description": "After the events of Enies Lobby, the crew enters a period of reflection and recuperation. They welcome new crew members and prepare for their next adventures, including the mysterious Thriller Bark.",
        "episodes": 5,
        "image": "/post_enies_lobby.jpg",
        "time": 3.2,
        "created_date": "2022-03-10",
        "finished_date": "2022-03-15",
        "rate": 4.5
      },
      {
        "id": 19,
        "title": "Thriller Bark",
        "description": "The Thriller Bark arc takes the Straw Hat Pirates to a haunted, moving island where they encounter the eccentric Gecko Moria and his army of zombies. This spooky adventure tests their courage and leads to the shocking reveal of a former crewmate.",
        "episodes": 48,
        "image": "/thriller_bark.jpg",
        "time": 30.0,
        "created_date": "2022-03-20",
        "finished_date": "2022-04-20",
        "rate": 4.7
      },
      {
        "id": 20,
        "title": "Sabaody Archipelago",
        "description": "The Sabaody Archipelago arc sees the crew reunited after a two-year separation and facing off against the formidable Celestial Dragons. Tensions rise as they navigate the dangerous archipelago, setting the stage for the return to Fish-Man Island.",
        "episodes": 40,
        "image": "/sabaody.jpg",
        "time": 25.0,
        "created_date": "2022-05-01",
        "finished_date": "2022-06-01",
        "rate": 4.9
      },
      {
        "id": 21,
        "title": "Amazon Lily",
        "description": "In the Amazon Lily arc, Luffy finds himself on an island inhabited by the powerful and exclusively female Kuja Tribe. He faces challenges and eventually forms an alliance with the warrior Empress Boa Hancock.",
        "episodes": 10,
        "image": "/amazon_lily.jpg",
        "time": 6.3,
        "created_date": "2022-06-10",
        "finished_date": "2022-06-20",
        "rate": 4.6
      },
      {
        "id": 22,
        "title": "Impel Down",
        "description": "The Impel Down arc takes the crew to the infamous underwater prison of Impel Down in their quest to rescue their captured comrade, Ace. They confront dangerous inmates, prison guards, and the enigmatic warden, Magellan.",
        "episodes": 45,
        "image": "/impel_down.jpg",
        "time": 28.5,
        "created_date": "2022-07-01",
        "finished_date": "2022-08-01",
        "rate": 4.8
      },
      {
        "id": 23,
        "title": "Marineford War",
        "description": "The Marineford War is a world-shaking conflict between the Marines and the Whitebeard Pirates, with Luffy and his allies caught in the middle. The war has far-reaching consequences and marks a turning point in the series.",
        "episodes": 59,
        "image": "/marine_ford.jpg",
        "time": 37.2,
        "created_date": "2022-08-10",
        "finished_date": "2022-09-20",
        "rate": 4.9
      },
      {
        "id": 24,
        "title": "Post-War",
        "description": "Following the events of the Marineford War, the crew members go their separate ways temporarily. They recover from their losses and plan their next moves as the world's balance of power undergoes a significant shift.",
        "episodes": 5,
        "image": "/post_war.jpg",
        "time": 3.2,
        "created_date": "2022-09-25",
        "finished_date": "2022-09-30",
        "rate": 4.5
      },
      {
        "id": 25,
        "title": "Return to Sabaody",
        "description": "In the Return to Sabaody arc, the crew reunites after their two-year separation and faces off against a new threat, the Fish-Man Pirates. This arc showcases the crew's growth and new abilities after their training.",
        "episodes": 9,
        "image": "/return_to_sabaody.jpg",
        "time": 5.7,
        "created_date": "2022-10-01",
        "finished_date": "2022-10-10",
        "rate": 4.7
      },
      {
        "id": 26,
        "title": "Fish-Man Island",
        "description": "The Fish-Man Island arc takes the Straw Hat Pirates to the underwater kingdom of Fish-Man Island, where they confront racism, discrimination, and the powerful Fish-Man Pirates. Luffy's actions have far-reaching consequences in this arc.",
        "episodes": 61,
        "image": "/fishman_island.jpg",
        "time": 38.7,
        "created_date": "2022-10-15",
        "finished_date": "2022-12-10",
        "rate": 4.8
      },
      {
        "id": 27,
        "title": "Punk Hazard",
        "description": "The Punk Hazard arc finds the crew on the mysterious island of Punk Hazard, where they encounter two rival factions, Caesar Clown, and the deadly experiments of the underground organization, Doflamingo's shadowy influence looms over this arc.",
        "episodes": 47,
        "image": "/punk_hazard.jpg",
        "time": 29.7,
        "created_date": "2023-01-01",
        "finished_date": "2023-02-15",
        "rate": 4.6
      },
      {
        "id": 28,
        "title": "Dressrosa",
        "description": "The Dressrosa arc features the crew's involvement in a rebellion against the tyrannical Donquixote Doflamingo in the kingdom of Dressrosa. Luffy's alliance with Law and their pursuit of Doflamingo lead to intense battles and political intrigue.",
        "episodes": 118,
        "image": "/dressrosa.jpg",
        "time": 74.8,
        "created_date": "2023-03-01",
        "finished_date": "2023-06-15",
        "rate": 4.9
      },
      {
        "id": 29,
        "title": "Zou",
        "description": "The Zou arc takes the crew to the elephant-sized island of Zou, where they encounter the Mink Tribe and uncover a crucial piece of information regarding the Road Poneglyphs. The arc delves into the mysteries of the One Piece world.",
        "episodes": 19,
        "image": "/zou.jpg",
        "time": 12.0,
        "created_date": "2023-06-20",
        "finished_date": "2023-07-10",
        "rate": 4.7
      },
      {
        "id": 30,
        "title": "Whole Cake Island",
        "description": "The Whole Cake Island arc features the crew's daring rescue mission to save their comrade Sanji from a politically influential and powerful family, the Big Mom Pirates. This arc explores themes of family, betrayal, and alliances.",
        "episodes": 90,
        "image": "/whole_cake_island.jpg",
        "time": 57.0,
        "created_date": "2023-07-15",
        "finished_date": "2023-09-01",
        "rate": 4.8
      },
      {
        "id": 31,
        "title": "Reverie",
        "description": "The Reverie arc is a gathering of world leaders in the Holy Land Mariejois, where major plotlines are developed and the consequences of the Straw Hat Pirates' actions are discussed. This arc sets the stage for future events.",
        "episodes": 1,
        "image": "/reverie.jpg",
        "time": 0.6,
        "created_date": "2023-09-10",
        "finished_date": "2023-09-11",
        "rate": 4.4
      },
      {
        "id": 32,
        "title": "Wano Country",
        "description": "The Wano Country arc is a massive and ongoing saga where the Straw Hat Pirates enter the isolated Wano Country to overthrow the tyrannical rule of Kaido and Orochi. This arc delves into samurai culture, alliances, and epic battles.",
        "episodes": "Ongoing",
        "image": "/wano.jpg",
        "time": "Ongoing",
        "created_date": "2023-09-15",
        "finished_date": "N/A",
        "rate": "Ongoing"
      }
  ]